#+TITLE: Emacs Literate Configuration
#+FILETAGS: Emacs
#+PROPERTY: header-args :tangle yes :results silent

* Literate Emacs Config
:PROPERTIES:
:CREATED:  [2018-02-28 Wed 11:46]
:ID:       862BFFED-2F54-4769-8064-FFF87E8B6A6F
:END:
:LOGBOOK:
CLOCK: [2018-03-02 Fri 11:45]--[2018-03-02 Fri 11:58] =>  0:13
CLOCK: [2018-03-02 Fri 10:52]--[2018-03-02 Fri 11:38] =>  0:46
CLOCK: [2018-03-02 Fri 10:42]--[2018-03-02 Fri 10:48] =>  0:06
CLOCK: [2018-03-01 Thu 17:16]--[2018-03-01 Thu 18:21] =>  1:05
CLOCK: [2018-03-01 Thu 15:42]--[2018-03-01 Thu 17:15] =>  1:33
CLOCK: [2018-03-01 Thu 14:12]--[2018-03-01 Thu 15:22] =>  1:10
CLOCK: [2018-03-01 Thu 13:57]--[2018-03-01 Thu 14:09] =>  0:12
CLOCK: [2018-03-01 Thu 11:28]--[2018-03-01 Thu 13:03] =>  1:35
CLOCK: [2018-02-28 Wed 17:29]--[2018-02-28 Wed 18:32] =>  1:03
CLOCK: [2018-02-28 Wed 15:53]--[2018-02-28 Wed 17:24] =>  1:31
CLOCK: [2018-02-28 Wed 15:09]--[2018-02-28 Wed 15:47] =>  0:38
CLOCK: [2018-02-28 Wed 11:46]--[2018-02-28 Wed 11:47] =>  0:01
:END:
** TODO [[https://github.com/gilbertw1/emacs-literate-starter][gilbertw1/emacs-literate-starter: A simple template that can be used to get started with an efficient literate Emacs configuration]]
:PROPERTIES:
:CREATED: [2018-02-27 Tue 17:38]
:END:
:LOGBOOK:
CLOCK: [2018-02-28 Wed 11:47]--[2018-02-28 Wed 11:56] =>  0:09
CLOCK: [2018-02-28 Wed 11:27]--[2018-02-28 Wed 11:34] =>  0:07
CLOCK: [2018-02-27 Tue 17:30]--[2018-02-27 Tue 17:45] =>  0:15
:END:
- [[id:D32DF1C0-3FBB-4832-9CFA-1F5118DB9D08][nilcons/emacs-use-package-fast: Discussion on how to achieve fast initialization of emacs using melpa with use-package]]
*** TODO [[https://github.com/gilbertw1/bmacs][gilbertw1/bmacs: Bryan's Emacs Configuration]]
:PROPERTIES:
:CREATED: [2018-02-28 Wed 11:34]
:END:
:LOGBOOK:
CLOCK: [2018-02-28 Wed 11:34]--[2018-02-28 Wed 11:46] =>  0:12
:END:
** DONE [[http://emacsredux.com/blog/2014/07/25/configure-the-scratch-buffers-mode/][Configure the scratch buffer's mode - Emacs Redux]]
CLOSED: [2018-05-08 Tue 13:47]
:PROPERTIES:
:CREATED: [2018-05-08 Tue 13:46]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-05-08 Tue 13:47]
CLOCK: [2018-05-08 Tue 13:46]--[2018-05-08 Tue 13:47] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp
  (setq initial-major-mode 'org-mode)
#+END_SRC
**** [[https://github.com/tarsius/moody][tarsius/moody: Tabs and ribbons for the mode-line]]
:PROPERTIES:
:CREATED: [2018-03-12 Mon 15:40]
:ID:       BCAD745F-F5D0-4B09-961D-E8E619DA34FC
:END:
:LOGBOOK:
CLOCK: [2018-03-12 Mon 15:43]--[2018-03-12 Mon 15:59] =>  0:16
CLOCK: [2018-03-12 Mon 15:39]--[2018-03-12 Mon 15:41] =>  0:02
:END:
#+BEGIN_SRC emacs-lisp
  (use-package moody
    :config
    (if +is-emacs-ns
        (setq moody-slant-function #'moody-slant-apple-rgb))

    (require 'smart-mode-line)
    (moody-replace-sml/mode-line-buffer-identification)

    (moody-replace-mode-line-buffer-identification)
    (moody-replace-vc-mode))
#+END_SRC
***** CANCELLED [[https://emacs.stackexchange.com/questions/2338/how-can-i-display-the-parent-directory-of-the-current-file-in-the-modeline][mode line - How can I display the parent directory of the current file in the modeline? - Emacs Stack Exchange]]
CLOSED: [2018-03-12 Mon 18:12]
:PROPERTIES:
:CREATED: [2018-03-12 Mon 18:05]
:END:
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2018-03-12 Mon 18:12] \\
  Cannot get it working for moody (moody has it own customizations)
CLOCK: [2018-03-12 Mon 18:05]--[2018-03-12 Mon 18:12] =>  0:07
:END:
***** DONE [[https://github.com/tarsius/moody/issues/1][smart-mode-line integration? 路 Issue #1 路 tarsius/moody]]
CLOSED: [2018-03-12 Mon 18:21]
:PROPERTIES:
:CREATED: [2018-03-12 Mon 18:12]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-12 Mon 18:21]
CLOCK: [2018-03-12 Mon 18:12]--[2018-03-12 Mon 18:21] =>  0:09
:END:
#+BEGIN_SRC emacs-lisp
  (use-package smart-mode-line)
#+END_SRC
*** DONE [[https://www.emacswiki.org/emacs/zoom-frm.el][EmacsWiki: zoom-frm.el]]
CLOSED: [2018-04-19 Thu 10:52]
:PROPERTIES:
:CREATED: [2018-04-19 Thu 10:49]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-04-19 Thu 10:52]
CLOCK: [2018-04-19 Thu 10:49]--[2018-04-19 Thu 10:52] =>  0:03
:END:
** DONE epa
CLOSED: [2018-03-21 Wed 15:05]
:PROPERTIES:
:CREATED: [2018-03-21 Wed 15:02]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-21 Wed 15:05]
CLOCK: [2018-03-21 Wed 15:02]--[2018-03-21 Wed 15:05] =>  0:03
:END:
#+BEGIN_SRC emacs-lisp
  (use-package epa
    :ensure nil
    :config
    (setq epa-file-encrypt-to user-mail-address
          ;; With GPG 2.1, this forces gpg-agent to use the Emacs minibuffer to
          ;; prompt for the key passphrase.
          epa-pinentry-mode 'loopback))
#+END_SRC
** General
:PROPERTIES:
:CREATED:  [2018-02-28 Wed 16:14]
:END:
:LOGBOOK:
CLOCK: [2018-05-17 Thu 11:13]--[2018-05-17 Thu 11:13] =>  0:00
- bind C-h again
CLOCK: [2018-05-17 Thu 11:07]--[2018-05-17 Thu 11:08] =>  0:01
- revert C-h
  + C-h doesn't work in macOS input method
:END:
#+BEGIN_SRC emacs-lisp
  (use-package general
    :config
    (general-evil-setup t)
    (general-auto-unbind-keys)

    (general-create-definer
      +leader
      :prefix "SPC"
      :non-normal-prefix "M-m"
      :states '(motion insert emacs))

    (general-create-definer
      +enable-leader
      :status '(motion normal visual)
      "SPC" nil)

    (general-create-definer
      +local-leader
      :prefix "'"
      :non-normal-prefix "M-m m"
      :states '(motion insert emacs))

    (mmap "M-s" #'evil-write)

    (general-define-key
     :keymaps 'input-decode-map
     "C-h" [backspace]))
#+END_SRC
*** DONE [[https://github.com/noctuid/general.el/issues/97][Non-prefix key error but still working? 路 Issue #97 路 noctuid/general.el]]
CLOSED: [2018-03-02 Fri 15:33]
:PROPERTIES:
:CREATED: [2018-03-02 Fri 15:22]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-02 Fri 15:33]
CLOCK: [2018-03-02 Fri 15:07]--[2018-03-02 Fri 15:32] =>  0:25
- use =general-auto-unbind-keys= to unbind leader key
:END:
** Evil
:PROPERTIES:
:CREATED:  [2018-02-28 Wed 15:53]
:END:
:LOGBOOK:
CLOCK: [2018-03-12 Mon 16:00]--[2018-03-12 Mon 16:02] =>  0:02
- disable evil mode-line segment
- use cursor to recognize the mode
CLOCK: [2018-03-09 Fri 12:11]--[2018-03-09 Fri 12:12] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :init
    (setq evil-mode-line-format nil)
    (setq evil-respect-visual-line-mode t)
    (setq evil-want-Y-yank-to-eol t)
    (setq evil-symbol-word-search t)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-visual-char-semi-exclusive t)
    (setq evil-ex-search-highlight-all nil)
    (evil-mode)
    :config
    (evil-select-search-module 'evil-search-module 'evil-search)
    (mapc #'evil-declare-ignore-repeat
          '(kill-this-buffer
            ido-kill-buffer
            outline-next-visible-heading
            outline-previous-visible-heading
            outline-up-heading
            evil-visualstar/begin-search-forward
            evil-visualstar/begin-search-backward
            org-export-dispatch
            org-end-of-line
            org-beginning-of-line
            org-open-at-point
            org-cycle
            org-shifttab
            org-ctrl-c-ctrl-c
            org-next-visible-heading
            org-previous-visible-heading
            split-window-below
            split-window-below-and-focus
            split-window-right
            split-window-right-and-focus
            evilmi-jump-items))
    (defalias 'evil-visual-update-x-selection 'ignore)

    (setq evil-normal-state-cursor '(box "DarkGoldenrod2")
          evil-insert-state-cursor '((bar . 2) "chartreuse3")
          evil-emacs-state-cursor '(box "SkyBlue2")
          evil-replace-state-cursor '((hbar . 2) "chocolate")
          evil-visual-state-cursor '((hbar . 2) "gray")
          evil-motion-state-cursor '(box "plum3"))

    (setq-default evil-shift-width 2)

    (evil-define-motion evil-goto-line (count)
      "Go to the first non-blank character of line COUNT.
  By default the (truly) last line."
      :jump t
      :type line
      (if (null count)
          (goto-char (buffer-size))
        (goto-char (point-min))
        (forward-line (1- count)))
      (evil-first-non-blank))

    (defun +evil/reselect-paste ()
      "Go back into visual mode and reselect the last pasted region."
      (interactive)
      (cl-destructuring-bind (_ _ _ beg end &optional _)
          evil-last-paste
        (evil-visual-make-selection
         (save-excursion (goto-char beg) (point-marker))
         end)))
    :general
    (nmap
      "gp" #'+evil/reselect-paste))
#+END_SRC
*** evil-args
:PROPERTIES:
:CREATED:  [2018-03-05 Mon 15:03]
:END:
:LOGBOOK:
CLOCK: [2018-03-05 Mon 15:03]--[2018-03-05 Mon 15:06] =>  0:03
:END:
#+BEGIN_SRC emacs-lisp
  (use-package evil-args
    :commands (evil-inner-arg
               evil-outer-arg
               evil-forward-arg
               evil-backward-arg
               evil-jump-out-args)
    :general
    (general-define-key
     :keymaps 'evil-inner-text-objects-map
     "a" 'evil-inner-arg)
    (general-define-key
     :keymaps 'evil-outer-text-objects-map
     "a" 'evil-outer-arg))
#+END_SRC
*** evil-embrace
:PROPERTIES:
:CREATED:  [2018-03-02 Fri 14:23]
:END:
:LOGBOOK:
CLOCK: [2018-03-06 Tue 15:08]--[2018-03-06 Tue 15:10] =>  0:02
- fix lazy-loading issue
CLOCK: [2018-03-02 Fri 14:23]--[2018-03-02 Fri 14:35] =>  0:12
:END:
#+BEGIN_SRC emacs-lisp
  (use-package evil-embrace
    :commands (evil-embrace-enable-evil-surround-integration)
    :hook (org-mode . embrace-org-mode-hook)
    :hook (ruby-mode . embrace-ruby-mode-hook)
    :init
    (eval-after-load 'evil-surround
      (evil-embrace-enable-evil-surround-integration))
    :config
    (setq evil-embrace-show-help-p nil))
#+END_SRC
*** evil-multiedit
:PROPERTIES:
:CREATED:  [2018-03-02 Fri 14:24]
:END:
:LOGBOOK:
CLOCK: [2018-03-02 Fri 14:35]--[2018-03-02 Fri 14:47] =>  0:12
:END:
#+BEGIN_SRC emacs-lisp
  (use-package evil-multiedit
    :commands (evil-multiedit-match-all
               evil-multiedit-match-and-next
               evil-multiedit-match-and-prev
               evil-multiedit-toggle-marker-here
               evil-multiedit-ex-match)
    :config
    (evil-ex-define-cmd "ie[dit]" 'evil-multiedit-ex-match)
    :general
    (nvmap
      "R" #'evil-multiedit-match-all)
    (+leader
     "se" #'evil-multiedit-match-all
     "sr" #'evil-multiedit-restore
     "sm" #'evil-multiedit-toggle-marker-here)

    (general-define-key
     :keymaps 'evil-multiedit-state-map
     "C-f" #'iedit-restrict-function
     "S" #'evil-multiedit--substitute
     "C-n" #'evil-multiedit-next
     "C-p" #'evil-multiedit-prev)

    (general-define-key
     :keymaps '(motion evil-multiedit-state-map)
     "RET" #'evil-multiedit-toggle-or-restrict-region))
#+END_SRC
*** DONE [[https://github.com/emacs-evil/evil-ediff][emacs-evil/evil-ediff: Make ediff a little more evil]]
CLOSED: [2018-03-15 Thu 15:15]
:PROPERTIES:
:CREATED: [2018-03-15 Thu 15:12]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-15 Thu 15:15]
CLOCK: [2018-03-15 Thu 15:12]--[2018-03-15 Thu 15:15] =>  0:03
:END:
#+BEGIN_SRC emacs-lisp
  (use-package evil-ediff
    :after (evil ediff))
#+END_SRC
** CANCELLED [[https://github.com/purcell/disable-mouse][purcell/disable-mouse: Disable the mouse in Emacs]]
CLOSED: [2018-03-07 Wed 17:55]
:PROPERTIES:
:CREATED: [2018-03-07 Wed 17:53]
:END:
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2018-03-07 Wed 17:55] \\
  Don't disable mouse clicking for cursor positioning in buffers
CLOCK: [2018-03-07 Wed 17:53]--[2018-03-07 Wed 17:54] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package disable-mouse
    :config
    (global-disable-mouse-mode))
#+END_SRC
** editorconfig
:PROPERTIES:
:CREATED:  [2018-03-02 Fri 16:18]
:END:
:LOGBOOK:
CLOCK: [2018-03-02 Fri 16:18]--[2018-03-02 Fri 16:22] =>  0:04
:END:
#+BEGIN_SRC emacs-lisp
  (use-package editorconfig
    :config
    (editorconfig-mode 1))
#+END_SRC
** dumb-jump
:PROPERTIES:
:CREATED:  [2018-03-05 Mon 14:26]
:END:
:LOGBOOK:
CLOCK: [2018-03-05 Mon 14:26]--[2018-03-05 Mon 14:40] =>  0:14
:END:
- setup dumb-jump
  #+BEGIN_SRC emacs-lisp
    (use-package dumb-jump
      :commands (dumb-jump-go dumb-jump-quick-look
                 dumb-jump-back dumb-jump-result-follow)
      :config
      (setq dumb-jump-selector 'ivy))
  #+END_SRC
- override goto definition
  #+BEGIN_SRC emacs-lisp
    (defun +goto-definition (identifier &optional other-window)
      (interactive
       (list (thing-at-point 'symbol t)
             current-prefix-arg))
      (cond ((null identifier)
             (user-error "Nothing under point"))

            ((and (require 'dumb-jump nil t)
                  ;; dumb-jump doesn't tell us if it succeeded or not
                  (let ((old-fn (symbol-function 'dumb-jump-get-results))
                        successful)
                    (cl-letf (((symbol-function 'dumb-jump-get-results)
                               (lambda (&optional prompt)
                                 (let* ((plist (funcall old-fn prompt))
                                        (results (plist-get plist :results)))
                                   (when (and results (> (length results) 0))
                                     (setq successful t))
                                   plist))))
                      (if other-window
                          (dumb-jump-go-other-window)
                        (dumb-jump-go))
                      successful))))

            ((and evil-mode
                  (cl-destructuring-bind (beg . end)
                      (bounds-of-thing-at-point 'symbol)
                    (evil-goto-definition)
                    (let ((pt (point)))
                      (not (and (>= pt beg)
                                (<  pt end)))))))

            (t (user-error "Couldn't find '%s'" identifier))))

    (mmap
      "gd" #'+goto-definition)
  #+END_SRC
** ediff
:PROPERTIES:
:CREATED:  [2018-03-15 Thu 15:15]
:END:
:LOGBOOK:
CLOCK: [2018-03-15 Thu 15:15]--[2018-03-15 Thu 15:16] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp
  (use-package ediff
    :config
    (setq ediff-diff-options "-w"
          ediff-split-window-function #'split-window-horizontally
          ediff-window-setup-function #'ediff-setup-windows-plain))
#+END_SRC
* Compilation
:LOGBOOK:
CLOCK: [2018-03-06 Tue 16:45]--[2018-03-06 Tue 16:47] =>  0:02
- fix gg in =compilation-mode-map=
:END:
  #+BEGIN_SRC emacs-lisp
    (use-package compile
      :config
      (add-to-list 'shackle-rules '(compilation-mode :custom +compilation-popup :regexp t :select nil :align 'below :size 0.33))
      :general
      (mmap
        :keymaps 'compilation-mode-map
        "g" nil
        "gg" #'evil-goto-first-line
        "gr" #'recompile)
      (+enable-leader
        :keymaps 'compilation-mode-map))
  #+END_SRC
** company
:PROPERTIES:
:CREATED:  [2018-02-28 Wed 18:16]
:END:
:LOGBOOK:
CLOCK: [2018-03-02 Fri 16:17]--[2018-03-02 Fri 16:18] =>  0:01
- fix C-w in company-active-mode
:END:
#+BEGIN_SRC emacs-lisp
  (use-package company
    :init
    (setq company-idle-delay 0.2
          company-require-match 'never
          company-tooltip-align-annotations t
          company-dabbrev-ignore-case nil
          company-dabbrev-downcase nil)

    (setq company-backends
          '(company-keywords
            company-files
            company-capf
            company-dabbrev-code
            company-dabbrev))

    (global-company-mode)
    :config
    (defun +evil-complete (arg)
      (interactive)
      (unless (company-complete)
        (hippie-expand arg)))

    (setq evil-complete-next-func '+evil-complete)
    (setq evil-complete-previous-func '+evil-complete)
    :general
    (general-define-key
     :keymaps 'company-active-map
     "C-w" nil
     "C-n" 'company-select-next
     "C-p" 'company-select-previous))

  (use-package company-statistics
    :hook (company-mode . company-statistics-mode)
    :init
    (setq company-statistics-file (concat +local-directory "company-statistics-cache.el")))
#+END_SRC
*** DONE [[https://twitter.com/EmacsReddit/status/973571278014525441][/r/Emacs on Twitter: "Configuring company-mode? https://t.co/N1FDEE9PpN #emacs"]] :Twitter:
CLOSED: [2018-03-14 Wed 11:25] SCHEDULED: <2018-03-13 Tue>
:PROPERTIES:
:CREATED: [2018-03-13 Tue 23:11]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-14 Wed 11:25]
CLOCK: [2018-03-14 Wed 11:20]--[2018-03-14 Wed 11:25] =>  0:05
:END:
#+BEGIN_QUOTE
Their is a buffer local variable called company-backends that holds a
list all the backends that can be used for the current
buffer. company-mode starts with the first backend in the list and
calls its prefix function. If that prefix function returns non-nil it
will use that backend and skip the rest (unless it is a grouped
backend, which you can read about in the doc string). If it returns
nil it will keep calling the prefix function of each backend in the
list.

Once a backend gives a non-nil prefix, company calls the candidate
function which populates the pop up. You can use the function
company-diag to see which backend is being used at point and what it
returns. You can reorder the backends to give priority to the ones you
want to run first.

Note that some dumb backends, such as company-dabbrev, company-capf,
and company-ctags, will always return non-nil for their prefix even if
they have no candidates to provide. Therefore they should almost
always be grouped at the back of company-backends.
#+END_QUOTE
- [[id:FA75D853-6514-487F-A0E9-91F212EB8CCB][ananthakumaran/tide: Tide - TypeScript Interactive Development Environment for Emacs]]
** magit
:PROPERTIES:
:CREATED:  [2018-02-28 Wed 17:54]
:END:
:LOGBOOK:
CLOCK: [2018-03-05 Mon 15:16]--[2018-03-05 Mon 15:18] =>  0:02
- bind magit-blame to SPC g b
:END:
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :init
    ;; avoid max-specpdl-size error,
    ;; See also [[id:CF8198D2-285C-4E0C-9548-2EBBD13D5F50][diff-hl + Magit == 'max-lisp-eval-depth' 'lisp nesting exceeds max-lisp-eval-depth {Mac OS X} 路 Issue #65 路 dgutov/diff-hl]]
    (magit-auto-revert-mode -1)
    :config
    (setq magit-revision-show-gravatars '("^Author:     " . "^Commit:     "))
    (setq magit-repository-directories '(("~/Projects/" . 2)))
    :general
    (+enable-leader
     :keymaps
     '(magit-mode-map
       magit-status-mode-map
       magit-diff-mode-map
       magit-process-mode-map
       magit-blame-read-only-mode-map
       magit-log-mode-map))
    (+leader
      "gb" #'magit-blame
      "gs" #'magit-status
      "gi" #'magit-init
      "gl" #'magit-log-buffer-file))
#+END_SRC
*** DONE [[id:4C85A0E7-DC91-43FC-A180-56BAF3A07967][vermiculus/magithub]]
CLOSED: [2018-05-10 Thu 10:38]
:PROPERTIES:
:CREATED: [2018-05-10 Thu 10:25]
:ID:       9FDF221C-789D-498A-965C-AE802CE5EFD1
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-05-10 Thu 10:38]
CLOCK: [2018-05-10 Thu 10:32]--[2018-05-10 Thu 10:38] =>  0:06
CLOCK: [2018-05-10 Thu 10:25]--[2018-05-10 Thu 10:30] =>  0:05
:END:
#+BEGIN_SRC emacs-lisp
  (use-package magithub
    :after magit
    :config
    (setq magithub-clone-default-directory "~/Projects")
    (setq magithub-dir (concat +local-directory "magithub/"))
    (magithub-feature-autoinject t))
#+END_SRC
*** DONE [[https://github.com/emacs-evil/evil-magit/pull/41][Naming changes in project. by MichaelStergianis 路 Pull Request #41 路 emacs-evil/evil-magit]]
CLOSED: [2018-04-11 Wed 14:24]
:PROPERTIES:
:CREATED: [2018-04-11 Wed 14:22]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-04-11 Wed 14:24]
CLOCK: [2018-04-11 Wed 14:20]--[2018-04-11 Wed 14:24] =>  0:04
:END:
** DONE [[https://github.com/magit/orgit][magit/orgit: Support for Org links to Magit buffers]]
CLOSED: [2018-03-13 Tue 10:36]
:PROPERTIES:
:CREATED: [2018-03-13 Tue 10:35]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-13 Tue 10:36]
CLOCK: [2018-03-13 Tue 10:35]--[2018-03-13 Tue 10:36] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp
  (use-package orgit
    :after (org magit))
#+END_SRC
** DONE [[https://github.com/sshaw/git-link][sshaw/git-link: Emacs package to get the GitHub/Bitbucket/GitLab/... URL for a buffer location]]
CLOSED: [2018-03-15 Thu 15:21]
:PROPERTIES:
:CREATED: [2018-03-15 Thu 15:18]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-15 Thu 15:21]
CLOCK: [2018-03-15 Thu 15:18]--[2018-03-15 Thu 15:21] =>  0:03
:END:
#+BEGIN_SRC emacs-lisp
  (use-package git-link
    :commands (git-link git-link-commit git-link-homepage)
    :general
    (+leader
      "gll" #'git-link
      "glc" #'git-link-commit
      "glh" #'git-link-homepage))
#+END_SRC
** Ruby
:PROPERTIES:
:CREATED:  [2018-03-01 Thu 14:52]
:END:
:LOGBOOK:
CLOCK: [2018-04-09 Mon 16:25]--[2018-04-09 Mon 16:28] =>  0:03
:END:
#+BEGIN_SRC emacs-lisp :results silent
  (use-package ruby-mode
    :mode "\\.rb$"
    :mode "\\.rake$"
    :mode "\\.gemspec$"
    :mode "\\.\\(pry\\|irb\\)rc$"
    :mode "/\\(Gem\\|Cap\\|Vagrant\\|Rake\\|Pod\\|Puppet\\|Berks\\)file$"
    :interpreter "ruby"
    :hook (ruby-mode . flycheck-mode))

  (use-package inf-ruby
    :commands (inf-ruby inf-ruby-console-auto))

  (use-package company-inf-ruby
    :after inf-ruby)

  (use-package robe
    :after ruby-mode
    :hook (ruby-mode . robe-mode))

  (use-package rbenv
    :after ruby-mode
    :hook (ruby-mode . rbenv-use-corresponding)
    :init
    (setq rbenv-show-active-ruby-in-modeline nil)
    :config
    (global-rbenv-mode))

  (use-package bundler
    :commands (bundle-check
               bundle-install
               bundle-console
               bundle-update
               bundle-exec
               bundle-open))

  (use-package rspec-mode
    :after ruby-mode
    :config
    (defun ruby/rspec-verify-directory (dir)
      "Launch tests in DIR directory.
  Called interactively it prompts for a directory."
      (interactive "Drspec directory: ")
      (rspec-run-single-file dir (rspec-core-options)))

    (add-to-list 'shackle-rules '(rspec-compilation-mode :custom +compilation-popup :regexp t :select nil :align 'below :size 0.33))
    :general
    (+local-leader
      :keymaps '(rspec-mode-map rspec-verifiable-mode-map)
      "ta"    'rspec-verify-all
      "tb"    'rspec-verify
      "tc"    'rspec-verify-continue
      "td"    'ruby/rspec-verify-directory
      "te"    'rspec-toggle-example-pendingness
      "tf"    'rspec-verify-method
      "tl"    'rspec-run-last-failed
      "tm"    'rspec-verify-matching
      "tr"    'rspec-rerun
      "tt"    'rspec-verify-single
      "t~"    'rspec-toggle-spec-and-target-find-example
      "t TAB" 'rspec-toggle-spec-and-target))

  (use-package minitest
    :config
    (add-to-list 'shackle-rules '(minitest-compilation-mode :custom +compilation-popup :regexp t :select nil :align 'below :size 0.33))
    :general
    (+local-leader
      :keymaps 'minitest-mode-map
      "ta" #'minitest-verify-all
      "tb" #'minitest-verify
      "tr" #'minitest-rerun
      "tt" #'minitest-verify-single))

  (use-package rubocop
    :commands (rubocop-mode)
    :hook (ruby-mode . rubocop-mode)
    :general
    (+local-leader
      :keymaps 'rubocop-mode-map
      "cd" #'rubocop-check-directory
      "cD" #'rubocop-autocorrect-directory
      "cf" #'rubocop-check-current-file
      "cF" #'rubocop-autocorrect-current-file
      "cp" #'rubocop-check-project
      "cP" #'rubocop-autocorrect-project))

  (use-package rake
    :commands (rake rake-find-task)
    :init
    (setq rake-cache-file (concat +local-directory "rake.cache"))
    (setq rake-completion-system 'default))
#+END_SRC
** Elixir
:PROPERTIES:
:CREATED:  [2018-03-01 Thu 17:08]
:END:
:LOGBOOK:
CLOCK: [2018-03-07 Wed 17:56]--[2018-03-07 Wed 18:07] =>  0:11
:END:
- elixir itself
  #+BEGIN_SRC emacs-lisp
    (use-package elixir-mode
      :mode "\\.exs?$"
      :mode "\\.elixir2$")

    (use-package ob-elixir
      :after ob
      :config
      (add-to-list 'org-babel-load-languages '(elixir . t)))

    (use-package smartparens-elixir
      :ensure smartparens
      :config
      ;; disable standard config; more disruptive than it needs to be
      (dolist (beg '("fn" "do" "def" "defp" "defmodule" "if" "unless" "case" "receive"))
        (sp-local-pair 'elixir-mode beg nil :actions :rem))
      ;; only complete the basics
      (sp-with-modes 'elixir-mode
        (sp-local-pair "do" "end" :when '(("RET" "<evil-ret>")) :post-handlers '("||\n[i]"))
        (sp-local-pair "do " " end")
        (sp-local-pair "fn " " end")))
  #+END_SRC
- alchemist
  #+BEGIN_SRC emacs-lisp
    (use-package alchemist
      :quelpa (alchemist :fetcher github :repo "dsdshcym/alchemist.el" :files (:defaults "*.exs" "alchemist-server"))
      :after elixir-mode
      :hook (elixir-mode . alchemist-mode)
      :config
      (add-to-list 'shackle-rules '("\\*alchemist.*\\*" :custom +compilation-popup :regexp t :select nil :align 'below :size 0.33))
      :general
      (+local-leader
       :keymaps 'alchemist-mode-map
       "el" 'alchemist-eval-current-line
       "eL" 'alchemist-eval-print-current-line
       "er" 'alchemist-eval-region
       "eR" 'alchemist-eval-print-region
       "eb" 'alchemist-eval-buffer
       "eB" 'alchemist-eval-print-buffer
       "ej" 'alchemist-eval-quoted-current-line
       "eJ" 'alchemist-eval-print-quoted-current-line
       "eu" 'alchemist-eval-quoted-region
       "eU" 'alchemist-eval-print-quoted-region
       "ev" 'alchemist-eval-quoted-buffer
       "eV" 'alchemist-eval-print-quoted-buffer

       "h:" 'alchemist-help
       "hH" 'alchemist-help-history
       "hh" 'alchemist-help-search-at-point
       "hr" 'alchemist-help--search-marked-region

       "m:" 'alchemist-mix-run
       "mc" 'alchemist-mix-compile
       "mx" 'alchemist-mix
       "mr" 'alchemist-mix-rerun-last-task

       "'"  'alchemist-iex-run
       "sc" 'alchemist-iex-compile-this-buffer
       "si" 'alchemist-iex-run
       "sI" 'alchemist-iex-project-run
       "sl" 'alchemist-iex-send-current-line
       "sL" 'alchemist-iex-send-current-line-and-go
       "sm" 'alchemist-iex-reload-module
       "sr" 'alchemist-iex-send-region
       "sR" 'alchemist-iex-send-region-and-go

       "ta" 'alchemist-mix-test
       "tb" 'alchemist-mix-test-this-buffer
       "tB" 'alchemist-project-run-tests-for-current-file
       "tt" 'alchemist-mix-test-at-point
       "tf" 'alchemist-mix-test-file
       "tF" 'alchemist-project-find-test
       "tn" 'alchemist-test-mode-jump-to-next-test
       "tp" 'alchemist-test-mode-jump-to-previous-test
       "tr" 'alchemist-mix-rerun-last-test
       "ts" 'alchemist-mix-test-stale
       "tR" 'alchemist-test-toggle-test-report-display
       "t <tab>" 'alchemist-project-toggle-file-and-tests
       "t <S-tab>" 'alchemist-project-toggle-file-and-tests-other-window

       "xb" 'alchemist-execute-this-buffer
       "xf" 'alchemist-execute-file
       "x:" 'alchemist-execute

       "cb" 'alchemist-compile-this-buffer
       "cf" 'alchemist-compile-file
       "c:" 'alchemist-compile

       "gg" 'alchemist-goto-definition-at-point
       "." 'alchemist-goto-definition-at-point
       "gb" 'alchemist-goto-jump-back
       ","  'alchemist-goto-jump-back
       "gN" 'alchemist-goto-jump-to-previous-def-symbol
       "gn" 'alchemist-goto-jump-to-next-def-symbol
       "gj" 'alchemist-goto-list-symbol-definitions

       "Xi" 'alchemist-hex-info-at-point
       "Xr" 'alchemist-hex-releases-at-point
       "XR" 'alchemist-hex-releases
       "XI" 'alchemist-hex-info
       "Xs" 'alchemist-hex-search

       "ol" 'alchemist-macroexpand-once-current-line
       "oL" 'alchemist-macroexpand-once-print-current-line
       "ok" 'alchemist-macroexpand-current-line
       "oK" 'alchemist-macroexpand-print-current-line
       "oi" 'alchemist-macroexpand-once-region
       "oI" 'alchemist-macroexpand-once-print-region
       "or" 'alchemist-macroexpand-region
       "oR" 'alchemist-macroexpand-print-region

       "fc" 'alchemist-phoenix-find-controllers
       "fC" 'alchemist-phoenix-find-channels
       "fm" 'alchemist-phoenix-find-models
       "fr" 'alchemist-phoenix-router
       "fs" 'alchemist-phoenix-find-static
       "ft" 'alchemist-phoenix-find-templates
       "fv" 'alchemist-phoenix-find-views
       "fw" 'alchemist-phoenix-find-web))
  #+END_SRC
- mix-format
  #+BEGIN_SRC emacs-lisp
    (use-package mix-format
      :quelpa (mix-format :fetcher github :repo "anildigital/mix-format.el")
      :after elixir-mode
      :config
      (setq mixfmt-mix (executable-find "mix"))
      (add-hook 'before-save-hook #'mix-format-before-save)

      (defun +reset-mixfmt-args ()
        (let* ((formatter-directory (locate-dominating-file default-directory ".formatter.exs"))
               (formatter-file (concat formatter-directory ".formatter.exs")))
          (if formatter-directory
              (setq mixfmt-args (list "--dot-formatter" formatter-file))
            (setq mixfmt-args nil))))
      (add-hook 'mix-format-hook #'+reset-mixfmt-args))
  #+END_SRC
*** DONE [[https://github.com/defunkt/markdown-mode][defunkt/markdown-mode: Emacs Markdown mode]]
CLOSED: [2018-03-13 Tue 12:03]
:PROPERTIES:
:CREATED: [2018-03-13 Tue 12:00]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-13 Tue 12:03]
CLOCK: [2018-03-13 Tue 12:00]--[2018-03-13 Tue 12:03] =>  0:03
:END:
#+BEGIN_SRC emacs-lisp
  (use-package markdown-mode
    :mode "/README$"
    :mode ("/README\\.md$" . gfm-mode)
    :mode "\\.m\\(d\\|arkdown\\)$"
    :init
    (setq markdown-enable-wiki-links t
          markdown-enable-math t
          markdown-italic-underscore t
          markdown-asymmetric-header t
          markdown-make-gfm-checkboxes-buttons t
          markdown-gfm-additional-languages '("sh")
          markdown-fontify-code-blocks-natively t
          markdown-hide-urls nil))
#+END_SRC
** YAML
:PROPERTIES:
:CREATED:  [2018-03-20 Tue 17:01]
:END:
:LOGBOOK:
CLOCK: [2018-03-20 Tue 17:01]--[2018-03-20 Tue 17:02] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode :mode "\\.ya?ml$")
#+END_SRC
** DONE [[https://elpa.gnu.org/packages/csv-mode.html][GNU ELPA - csv-mode]]
CLOSED: [2018-05-09 Wed 11:26]
:PROPERTIES:
:CREATED: [2018-05-09 Wed 11:25]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-05-09 Wed 11:26]
CLOCK: [2018-05-09 Wed 11:25]--[2018-05-09 Wed 11:26] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp
  (use-package csv-mode
    :mode "/\\.csv$")
#+END_SRC
** Agenda
:PROPERTIES:
:CREATED:  [2018-03-01 Thu 12:37]
:END:
:LOGBOOK:
CLOCK: [2018-04-13 Fri 11:32]--[2018-04-13 Fri 11:41] =>  0:09
CLOCK: [2018-04-13 Fri 11:12]--[2018-04-13 Fri 11:30] =>  0:18
:END:
#+BEGIN_SRC emacs-lisp
  (use-package org-agenda
    :ensure org-plus-contrib
    :commands (org-agenda-list
               org-agenda
               org-agenda-to-appt)
    :config
    (setq org-agenda-diary-file "~/Org/journal.org")
    (setq org-agenda-files '("~/Org" "~/Org/notes" "~/Org/lists" "~/.emacs.d/config.org"))

    ;; Overwrite the current window with the agenda
    (setq org-agenda-window-setup 'current-window)

    (setq org-agenda-restore-windows-after-quit t)

    (setq org-agenda-span 'day)

    (setq org-agenda-clockreport-parameter-plist
          '(:link t :maxlevel 9 :fileskip0 t :narrow 70! :formula "$4=$3*(60/25);t" :compact t))

    (setq org-agenda-custom-commands
          '(("d" agenda "Agenda for today's tasks only"
             ((org-agenda-entry-types '(:scheduled))
              (org-agenda-skip-scheduled-if-done t)
              (org-agenda-todo-ignore-scheduled 'all)
              (org-agenda-tag-filter-preset '("-TV" "-Movie" "-Animation"))))
            ("w" agenda "@WORK"
             ((org-agenda-tag-filter-preset '("+@WORK"))))))

    (setq org-agenda-skip-scheduled-if-deadline-is-shown 'not-today)
    (evil-set-initial-state 'org-agenda-mode 'normal)

    (defun +org/org-agenda-refresh-appt ()
      (interactive)
      (org-agenda-to-appt t))
    (run-at-time "24:01" 3600 '+org/org-agenda-refresh-appt))

  (use-package appt
    :ensure nil
    :config
    (defun +notification (title msg &optional subtitle group-id sound)
      (interactive)
      (call-process-shell-command
       (concat "terminal-notifier"
               " -title \"" title
               "\" -message \"" msg
               (if subtitle (concat "\" -subtitle \"" subtitle))
               (if sound (concat "\" -sound \"" sound))
               (if group-id (concat "\" -group \"" group-id))
               "\" -activate " "org.gnu.Emacs"
               " -sender " "org.gnu.Emacs"
               " -timeout " "3"
               "&")))

    (defun +macos-do-not-display-is-on? ()
      (string-prefix-p "1"
                       (shell-command-to-string
                        "defaults read ~/Library/Preferences/ByHost/com.apple.notificationcenterui.plist doNotDisturb")))

    (defun +appt-display (min-to-app new-time msg)
      (if (+macos-do-not-display-is-on?)
          (appt-disp-window min-to-app new-time msg)
        (+notification "Org Agenda Appointment" msg (format "Appointment in %s minute(s)" min-to-app) "1")))

    (setq appt-disp-window-function '+appt-display)
    :general
    (nmap
     :keymaps '(org-agenda-keymap)
     "<tab>" #'org-agenda-switch-to
     "<return>" #'org-agenda-switch-to
     "i" #'org-agenda-clock-in
     "s" #'org-agenda-schedule
     "d" #'org-agenda-deadline
     "t" #'org-agenda-todo
     "j" #'org-agenda-next-line
     "k" #'org-agenda-previous-line
     "L" #'org-agenda-log-mode
     "q" #'org-agenda-quit
     "f" #'org-agenda-later
     "b" #'org-agenda-earlier
     "gr" #'org-agenda-redo
     "R" #'org-agenda-clockreport-mode
     "gj" #'org-agenda-next-line
     "gk" #'org-agenda-previous-line))
#+END_SRC
*** DONE [[https://emacs.stackexchange.com/questions/20130/exclude-tag-from-default-agenda-view][org mode - Exclude tag from default agenda view - Emacs Stack Exchange]]
CLOSED: [2018-04-13 Fri 11:12]
:PROPERTIES:
:CREATED: [2018-04-13 Fri 11:07]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-04-13 Fri 11:12]
CLOCK: [2018-04-13 Fri 11:07]--[2018-04-13 Fri 11:12] =>  0:05
:END:
#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-agenda-tag-filter-preset nil)
#+END_SRC
*** DONE [[https://github.com/astahlman/ob-async][astahlman/ob-async: Asynchronous src_block execution for org-babel]]
CLOSED: [2018-05-08 Tue 14:14]
:PROPERTIES:
:CREATED: [2018-05-08 Tue 14:12]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-05-08 Tue 14:14]
CLOCK: [2018-05-08 Tue 14:12]--[2018-05-08 Tue 14:14] =>  0:02
:END:
#+BEGIN_SRC emacs-lisp
  (use-package ob-async
    :after ox)
#+END_SRC
** org-page
:PROPERTIES:
:CREATED:  [2018-03-02 Fri 16:10]
:END:
:LOGBOOK:
CLOCK: [2018-03-02 Fri 16:10]--[2018-03-02 Fri 16:17] =>  0:07
:END:
#+BEGIN_SRC emacs-lisp
  (use-package org-page
    :config
    (setq op/repository-directory "~/Projects/dsdshcym.github.io/"
          op/site-domain "http://dsdshcym.github.io"
          op/personal-github-link "https://github.com/dsdshcym"
          op/site-main-title "dsdshome"
          op/site-sub-title "This is my small blog :)"
          op/personal-disqus-shortname "dsdshcym-github-io"
          op/theme-root-directory (concat +emacs-directory "org-page-themes")
          op/theme 'wy))

  (defun +org-page/publish ()
    (interactive)
    (op/do-publication))

  (defun +org-page/new-post (&optional category default-tags)
    (interactive)
    (let* ((category (or category "blog"))
           (title (read-string "Title: "))
           (keywords (read-string "Keywords: "))
           (tags (read-string "Tags: " default-tags))
           (underscore-title (replace-regexp-in-string "[[:space:]]+" "_" title))
           (kebab-title (s-dashed-words underscore-title))
           (filename (concat kebab-title ".org"))
           (dir (concat (file-name-as-directory op/repository-directory)
                        (file-name-as-directory category)))
           (path (concat dir filename)))
      (op/git-change-branch op/repository-directory op/repository-org-branch)
      (if (file-exists-p path)
          (error "Post `%s' already exists." path))
      (unless (file-directory-p dir)
        (mkdir dir t))
      (switch-to-buffer (find-file path))
      (op/insert-options-template title
                                  (concat "/" category "/%y/%m/%d/" kebab-title)
                                  keywords
                                  tags)
      (save-buffer)))

  (defun +org-page/new-blog ()
    (interactive)
    (+org-page/new-post "blog"))

  (defun +org-page/new-clipping ()
    (interactive)
    (+org-page/new-post "clipping" "Clipping, "))
#+END_SRC
** DONE [[elfeed:planet.emacsen.org#http://acidwords.com/posts/2018-03-02-extending-org-mode-easy-templates.html][Sanel Zukan: Extending org-mode Easy Templates]]
CLOSED: [2018-03-06 Tue 16:42]
:PROPERTIES:
:CREATED: [2018-03-06 Tue 16:41]
:END:
:LOGBOOK:
CLOCK: [2018-03-07 Wed 15:51]--[2018-03-07 Wed 15:55] =>  0:04
- State "DONE"       from "TODO"       [2018-03-06 Tue 16:42]
CLOCK: [2018-03-06 Tue 16:41]--[2018-03-06 Tue 16:42] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp
  (setq org-structure-template-alist
        '(("l" "#+BEGIN_SRC emacs-lisp
  ?
  ,#+END_SRC")
          ("r" "#+BEGIN_SRC ruby
  ?
  ,#+END_SRC")
          ("x" "#+BEGIN_SRC elixir
  ?
  ,#+END_SRC")
          ("s" "#+BEGIN_SRC ?

  ,#+END_SRC")
          ("e" "#+BEGIN_EXAMPLE
  ?
  ,#+END_EXAMPLE")
          ("q" "#+BEGIN_QUOTE
  ?
  ,#+END_QUOTE")
          ("c" "#+BEGIN_CENTER
  ?
  ,#+END_CENTER")))
#+END_SRC
* elfeed
:PROPERTIES:
:CREATED:  [2018-03-02 Fri 17:51]
:END:
:LOGBOOK:
CLOCK: [2018-03-02 Fri 17:51]--[2018-03-02 Fri 18:04] =>  0:13
:END:
- elfeed
  #+BEGIN_SRC emacs-lisp
    (use-package elfeed
      :commands 'elfeed
      :config
      (defun +elfeed/org-elfeed-entry-store-link ()
        (interactive)
        (when (and (boundp 'elfeed-show-entry) elfeed-show-entry)
          (let* ((link (elfeed-entry-link elfeed-show-entry))
                 (title (elfeed-entry-title elfeed-show-entry)))
            (message title)
            (org-store-link-props
             :link link
             :description title))))
      (org-link-set-parameters "elfeed" :store #'+elfeed/org-elfeed-entry-store-link)
      :general
      (+leader
        "af" #'elfeed)
      (nmap
        :keymaps 'elfeed-search-mode-map
        "RET" #'elfeed-search-show-entry
        "s"   #'elfeed-search-live-filter
        "b"   #'elfeed-search-browse-url
        "c"   #'elfeed-db-compact
        "r"   #'elfeed-search-untag-all-unread
        "u"   #'elfeed-search-tag-all-unread
        "y"   #'elfeed-search-yank
        "gr"  #'elfeed-update
        "gR"  #'elfeed-search-update--force
        "gu"  #'elfeed-unjam
        "q"   #'elfeed-search-quit-window)
      (nmap
        :keymaps 'elfeed-show-mode-map
        "C-n" #'elfeed-show-next
        "C-p" #'elfeed-show-prev
        "y"   #'elfeed-show-yank
        "b"   #'elfeed-show-visit
        "q"   #'elfeed-kill-buffer))
  #+END_SRC
* mu4e
:PROPERTIES:
:CREATED:  [2018-03-05 Mon 11:46]
:END:
:LOGBOOK:
CLOCK: [2018-05-17 Thu 10:50]--[2018-05-17 Thu 10:51] =>  0:01
- auto update every 5 minutes
CLOCK: [2018-05-14 Mon 10:12]--[2018-05-14 Mon 10:13] =>  0:01
- remove ekohe-related settings
CLOCK: [2018-03-06 Tue 16:50]--[2018-03-06 Tue 16:51] =>  0:01
- replace =add-hook!= with =add-hook=
CLOCK: [2018-03-05 Mon 11:46]--[2018-03-05 Mon 11:48] =>  0:02
:END:
#+BEGIN_SRC emacs-lisp
  (use-package mu4e
    :ensure nil
    :commands (mu4e mu4e-compose-new)
    :init
    (setq url-mail-command 'mu4e-compose-new)
    :config
    (setq mu4e-completing-read-function 'completing-read)
    (setq mu4e-confirm-quit nil)

    ;; default
    (setq mu4e-maildir (expand-file-name "~/Maildir"))

    (setq mu4e-refile-folder "/gmail/all mail")
    (setq mu4e-drafts-folder "/gmail/drafts")
    (setq mu4e-sent-folder   "/gmail/sent")
    (setq mu4e-trash-folder  "/gmail/trash")

    ;;rename files when moving
    ;;NEEDED FOR MBSYNC
    (setq mu4e-change-filenames-when-moving t)

    ;; don't save message to Sent Messages, GMail/IMAP will take care of this
    (setq mu4e-sent-messages-behavior 'delete)

    (setq mu4e-update-interval 300)

    (setq mu4e-html2text-command "pandoc -f html -t org")

    ;; setup some handy shortcuts
    (setq mu4e-maildir-shortcuts
          '(("/gmail/inbox"    . ?i)
            ("/gmail/sent"     . ?s)
            ("/gmail/trash"    . ?t)
            ("/gmail/all mail" . ?a)))

    (setq mu4e-bookmarks
          '(
            ("flag:unread AND NOT flag:trashed AND NOT maildir:\"/gmail/all mail\""
             "Unread messages"  ?u)
            ("date:today..now AND NOT maildir:\"/gmail/all mail\""
             "Today's messages" ?t)
            ("date:7d..now AND NOT maildir:\"/gmail/all mail\""
             "Last 7 days"      ?w)
            )
          )

    (setq mu4e-get-mail-command "mbsync -a")

    (setq mu4e-attachment-dir "~/Downloads")

    (setq mu4e-view-prefer-html nil)

    ;; Store link to message if in header view, not to header query
    (setq org-mu4e-link-query-in-headers-mode nil)

    (setq mu4e-org-contacts-file (expand-file-name "~/Org/contacts.org"))
    (eval-after-load 'mu4e-headers
      (lambda ()
        (add-to-list 'mu4e-headers-actions
                     '("org-contact-add" . mu4e-action-add-org-contact) t)))
    (eval-after-load 'mu4e-view
      (lambda ()
        (add-to-list 'mu4e-view-actions
                     '("org-contact-add" . mu4e-action-add-org-contact) t)))

    (setq message-send-mail-function 'smtpmail-send-it
          starttls-use-gnutls t
          smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
          smtpmail-auth-credentials (expand-file-name "~/.authinfo.gpg")
          smtpmail-default-smtp-server "smtp.gmail.com"
          smtpmail-smtp-server "smtp.gmail.com"
          smtpmail-smtp-service 587)

    (defvar my-mu4e-account-alist
      '(("gmail"
         (mu4e-sent-folder   "/gmail/sent")
         (mu4e-drafts-folder "/gmail/drafts")
         (smtpmail-default-smtp-server "smtp.gmail.com")
         (smtpmail-smtp-user "dsdshcym")
         (smtpmail-smtp-server "smtp.gmail.com")
         ;; (smtpmail-stream-type starttls)
         (smtpmail-smtp-service 587))))

    (defun my-mu4e-set-account ()
      "Set the account for composing a message."
      (let* ((account
              (if mu4e-compose-parent-message
                  (let ((maildir (mu4e-message-field mu4e-compose-parent-message :maildir)))
                    (string-match "/\\(.*?\\)/" maildir)
                    (match-string 1 maildir))
                (completing-read (format "Compose with account: (%s) "
                                         (mapconcat #'(lambda (var) (car var))
                                                    my-mu4e-account-alist "/"))
                                 (mapcar #'(lambda (var) (car var)) my-mu4e-account-alist)
                                 nil t nil nil (caar my-mu4e-account-alist))))
             (account-vars (cdr (assoc account my-mu4e-account-alist))))
        (if account-vars
            (mapc #'(lambda (var)
                      (set (car var) (cadr var)))
                  account-vars)
          (error "No email account found"))))

    (add-hook 'mu4e-compose-pre-hook 'my-mu4e-set-account)

    (add-to-list 'mu4e-view-actions
                 '("browser" . mu4e-action-view-in-browser))
    :general
    (+leader
     "am" 'mu4e
     "aM" 'mu4e-compose-new))

  (use-package evil-mu4e
    :after mu4e)

  (use-package mu4e-maildirs-extension
    :after mu4e
    :config (mu4e-maildirs-extension-load))

  (use-package org-mu4e
    :ensure nil
    :after mu4e
    :config
    (setq org-mu4e-link-query-in-headers-mode nil
          org-mu4e-convert-to-html t)

    ;; Only render to html once. If the first send fails for whatever reason,
    ;; org-mu4e would do so each time you try again.
    (add-hook 'message-send-hook (lambda () (setq-local org-mu4e-convert-to-html nil))))
#+END_SRC
** DONE [[https://github.com/alpha22jp/atomic-chrome][alpha22jp/atomic-chrome: Edit text area on Chrome with Emacs using Atomic Chrome]]
CLOSED: [2018-03-13 Tue 11:58]
:PROPERTIES:
:CREATED: [2018-03-13 Tue 11:54]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-03-13 Tue 11:58]
CLOCK: [2018-03-13 Tue 11:54]--[2018-03-13 Tue 11:58] =>  0:04
:END:
#+BEGIN_SRC emacs-lisp
  (use-package atomic-chrome
    :hook (atomic-chrome-edit-done . delete-frame)
    :init
    (setq atomic-chrome-server-ghost-text-port 4002)
    (atomic-chrome-start-server)
    :config
    (setq atomic-chrome-default-major-mode 'org-mode)
    (setq atomic-chrome-url-major-mode-alist
          '(("github" . gfm-mode)
            ("gitlab" . gfm-mode)))
    (setq atomic-chrome-buffer-open-style 'frame))
#+END_SRC
* eshell
:PROPERTIES:
:CREATED:  [2018-05-10 Thu 10:40]
:END:
:LOGBOOK:
CLOCK: [2018-05-10 Thu 10:40]--[2018-05-10 Thu 10:41] =>  0:01
:END:
#+BEGIN_SRC emacs-lisp
  (use-package eshell
    :commands 'eshell
    :config
    (setq eshell-directory-name (concat +local-directory "eshell/")))
#+END_SRC
